{
    "education": [
        {
            "school": "University of Texas at Arlington",
            "degree": "Master's (MSc) in Computer Science",
            "location": "Arlington, Texas, United States",
            "description": "During my Master's program in Computer Science at The University of Texas at Arlington, I gained in-depth knowledge and practical skills in various areas of computer science. The program provided a comprehensive understanding of advanced algorithms, data structures, software engineering principles, and artificial intelligence. I also had the opportunity to collaborate with professors and fellow students on cutting-edge projects, further enhancing my problem-solving abilities and critical thinking skills. Through coursework, hands-on projects, I honed my expertise in areas such as artificial intelligence, machine learning, databases, cloud computing, and software development, preparing me for a successful career in the field of computer science.",
            "start": "Aug, 2021",
            "end": "May, 2023"
        },
        {
            "school": "Vishwakarma Institute of Technology, Pune",
            "degree": "Bachelor's (BTech) in Computer Engineering",
            "location": "Pune, Maharashtra, India",
            "description": "My Bachelor's degree in Computer Engineering from Vishwakarma Institute of Technology provided a strong foundation in fundamental concepts and principles of computer science. Through coursework and hands-on projects, I gained expertise in programming languages, data structures, algorithms, database management, and software development. The program also emphasized problem-solving, critical thinking, and teamwork skills, which are essential in the field of computer science. Additionally, I had the opportunity to work on industry-oriented projects and internships, which enhanced my practical knowledge and prepared me for real-world challenges. Overall, my undergraduate education in computer engineering equipped me with the necessary skills and knowledge to excel in the dynamic and ever-evolving field of technology.",
            "start": "Aug, 2014",
            "end": "May, 2018"
        }        
    ]
}