{
    "work": [
        {
            "company": "Benefit Harbor, LP",
            "title": "Software Engineer",
            "location": "Plano, Texas, United States",
            "responsibilites": "Developed the core business logic for an insurance broker application using Spring Boot and Hibernate, creating resilient RESTful web services to manage complex insurance data and ensure secure data storage. Created a comprehensive and automated reporting system for internal use and for external clients, including payroll, invoices, and employee insurance details, which increased operational efficiency for employers and carriers by 50%. Reduced API latency by 30% after optimizing data queries and adding indexes to the database to improve overall response speed. Supported and maintained a large-scale, monolithic insurance application, working with legacy technologies including JSP, Servlets, JPA, and jQuery to handle new feature requests and bug fixes. Collaborated effectively within a cross-functional Agile team, participating in daily stand-ups, sprint planning, and thorough code reviews to maintain high code quality and ensure successful sprint delivery. Trained the junior employees of the company to help them understand the application and its and coding standards.",
            "start": "July, 2023",
            "end": "Present"
        },
        {
            "company": "Coreview Systems Private Limited",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Architected and implemented a backend framework from scratch using Python and Django, which was foundational to designing and delivering reliable RESTful APIs. Developed a robust ETL solution using Apache Airflow and successfully demonstrated its effectiveness in a Proof of Concept (PoC), resolving data issues to achieve a 67% increase in efficiency and 100% data consistency. Engineered and automated CI/CD pipelines using Git, Docker, and Jenkins for seamless application deployment on AWS, achieving a 100% deployment success rate. Collaborated directly with the client to secure and analyze application requirements via Agile methodology, actively participating in a 10-member team to discuss progress, refine deliverables, and define the subsequent plan of action. Demonstrated ability to provide technical mentorship and guidance on QA practices, contributing to the growth and development of junior team members.",
            "start": "Nov, 2019",
            "end": "July, 2021"
        },
        {
            "company": "Cognizant Technology Solutions",
            "title": "Programmer Analyst",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Developed and engineered comprehensive test strategies based on documented requirements, ensuring end-to-end system flow validation and maximizing test coverage. Designed and executed API Automation Test scripts using Java and Selenium, integrating them into the regression test suite to increase overall test coverage to 87%. Executed core testing cycles, including developing and executing manual test cases, reporting defects, and creating SQL queries to verify data integrity directly within the MySQL database. Collaborated with a 22-member team throughout the development lifecycle to manage releases and successfully deploy all sprints on schedule under an Agile framework.",
            "start": "July, 2018",
            "end": "Oct, 2019"
        },
        {
            "company": "Tech Mahindra",
            "title": "Software Engineer, Intern",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Engineered custom Alexa Skill for sales and realtor assistants, utilizing Lambda function, DynamoDB, and S3 for robust data handling and storage, significantly enhancing system performance.",
            "start": "Feb, 2018",
            "end": "May, 2018"
        },
        {
            "company": "Trust Systems & Software",
            "title": "Software Engineer, Intern",
            "location": "Nagpur, Maharashtra, India",
            "responsibilites": "Created and executed comprehensive test plans for software applications, ensuring thorough testing coverage. Identified critical defects and worked closely with development teams to resolve them, improving product quality and customer satisfaction.",
            "start": "May, 2016",
            "end": "June, 2016"
        }
        
    ]
}