{
    "work": [
        {
            "company": "Benefit Harbor, LP",
            "title": "Software Engineer",
            "location": "Plano, Texas, United States",
            "responsibilites": "Developing an innovative self-service web application for employees to manage and enroll in insurance products using Java Spring and jQuery, streamlining the enrollment process and enhancing operational efficiency, resulting in a 70% reduction in employer’s time spent enrolling employees in benefits. Designing an enrollment feature that dynamically manages prerequisites for insurance products offered by over 20 carriers, each providing more than 40 different types of insurance, ensuring a seamless and efficient enrollment process. Identifying and resolving critical bugs in products swiftly to minimize customer impact and expedite issue resolution, ensuring seamless customer experience and operational continuity.",
            "start": "July, 2023",
            "end": "Present"
        },
        {
            "company": "Coreview Systems Private Limited",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Designed and developed a Python Django web framework and REST APIs using Django ORM, enabling seamless operations, which managed a high-volume user load exceeding 200,000 users, optimizing performance and reliability. Spearheaded a PoC on Apache Airflow by implementing efficient database synchronization, significantly increasing data consistency and reducing operational time by 67%. Implemented efficient application deployment on AWS by implementing CI/CD pipelines with Git and Jenkins, resulting in a 17% reduction in build time and optimizing the development lifecycle.",
            "start": "Nov, 2019",
            "end": "July, 2021"
        },
        {
            "company": "Cognizant Technology Solutions",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Planned a comprehensive testing strategy, executed story test preparations, and conducted bug reporting utilizing Agile methodology while collaborating seamlessly with a team of 20+ developers. Enhanced testing coverage to 76% by integrating automation test scripts into the Regression Suite for API testing, leveraging Selenium and Java to streamline and optimize testing processes.",
            "start": "July, 2018",
            "end": "Oct, 2019"
        },
        {
            "company": "Tech Mahindra",
            "title": "Software Engineer, Intern",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Engineered custom Alexa Skill for sales and realtor assistants, utilizing Lambda function, DynamoDB, and S3 for robust data handling and storage, significantly enhancing system performance.",
            "start": "Feb, 2018",
            "end": "May, 2018"
        },
        {
            "company": "Trust Systems & Software",
            "title": "Software Engineer, Intern",
            "location": "Nagpur, Maharashtra, India",
            "responsibilites": "Created and executed comprehensive test plans for software applications, ensuring thorough testing coverage. Identified critical defects and worked closely with development teams to resolve them, improving product quality and customer satisfaction.",
            "start": "May, 2016",
            "end": "June, 2016"
        }
        
    ]
}