{
    "work": [
        {
            "company": "Benefit Harbor, LP",
            "title": "Software Engineer",
            "location": "Plano, Texas, United States",
            "responsibilites": "Designing a self-service web application for employees to manage and enroll in insurance products. Streamlined the process by designing a dynamic enrollment feature for 20+ carriers, reducing employer time spent on enrollment by 70%. Developing and integrating automated data analysis processes, providing clients with intuitive, on-demand report generation that improved data accessibility and informed decision-making. Proactively identifying and resolving critical product issues, ensuring uninterrupted user experience and reducing response times for customer service. Conducting code reviews for peers, optimizing code and promoting coding standards.",
            "start": "July, 2023",
            "end": "Present"
        },
        {
            "company": "Coreview Systems Private Limited",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Collaborated with clients using Agile methodology to obtain, analyze, and develop web application requirements. Designed and implemented web framework and REST APIs to perform user requests on client applications. Developed a Poc for data synchronization using Airflow, enhancing data consistency and reducing sync time by 67%. Implemented CI/CD pipelines on AWS with Git and Jenkins, reducing build time and streamlining the development lifecycle.",
            "start": "Nov, 2019",
            "end": "July, 2021"
        },
        {
            "company": "Cognizant Technology Solutions",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Developed a comprehensive testing strategy within an Agile team, improving collaboration and issue tracking among 20+ developers. Enhanced testing coverage by 76% by automating regression testing with Selenium, reducing manual testing time and increasing accuracy.",
            "start": "July, 2018",
            "end": "Oct, 2019"
        },
        {
            "company": "Tech Mahindra",
            "title": "Software Engineer, Intern",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Engineered custom Alexa Skill for sales and realtor assistants, utilizing Lambda function, DynamoDB, and S3 for robust data handling and storage, significantly enhancing system performance.",
            "start": "Feb, 2018",
            "end": "May, 2018"
        },
        {
            "company": "Trust Systems & Software",
            "title": "Software Engineer, Intern",
            "location": "Nagpur, Maharashtra, India",
            "responsibilites": "Created and executed comprehensive test plans for software applications, ensuring thorough testing coverage. Identified critical defects and worked closely with development teams to resolve them, improving product quality and customer satisfaction.",
            "start": "May, 2016",
            "end": "June, 2016"
        }
        
    ]
}