{
    "work": [
        {
            "company": "Benefit Harbor, LP",
            "title": "Software Engineer",
            "location": "Plano, Texas, United States",
            "responsibilites": "Designed and implemented a comprehensive insurance portal, building the front end with JavaScript and developing the backend REST APIs with Spring Boot and Hibernate to ensure seamless communication in a microservices environment. Developed a comprehensive and automated reporting system for internal use and for external clients, including payroll, invoices, and employee insurance details, which increased operational efficiency for employers and carriers by 50%. Optimized SQL queries and database indexing, reducing latency and improving application performance by 60%. Supported and maintained a large-scale, monolithic insurance application, working with legacy technologies including JSP, Servlets, JPA, and jQuery to handle new feature requests and bug fixes.",
            "start": "July, 2023",
            "end": "Present"
        },
        {
            "company": "Coreview Systems Private Limited",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Helped architect and implement a custom framework from scratch using Python and Django, which was used to design and deliver reliable RESTful APIs for a web application while enforcing coding best practices and ensuring high code quality. Architected a robust ETL solution using Apache Airflow and successfully demonstrated its effectiveness in a Proof of Concept (PoC), resolving data issues to achieve a 67% increase in efficiency and 100% data consistency. Engineered and automated CI/CD pipelines using Git, Docker, and Jenkins for seamless application deployment on AWS, achieving a 100% deployment success rate. Collaborated effectively within a cross-functional Agile team, participating in daily stand-ups, sprint planning, and thorough code reviews to maintain high code quality and ensure successful sprint delivery.",
            "start": "Nov, 2019",
            "end": "July, 2021"
        },
        {
            "company": "Cognizant Technology Solutions",
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Engineered a comprehensive test strategy for API testing, defining high-level and low-level test cases that optimized the manual process and enhanced overall test coverage. Developed and executed API automation test scripts using Java and Selenium, integrating them into a regression suite to increase test coverage to 87%.",
            "start": "July, 2018",
            "end": "Oct, 2019"
        },
        {
            "company": "Tech Mahindra",
            "title": "Software Engineer, Intern",
            "location": "Pune, Maharashtra, India",
            "responsibilites": "Engineered custom Alexa Skill for sales and realtor assistants, utilizing Lambda function, DynamoDB, and S3 for robust data handling and storage, significantly enhancing system performance.",
            "start": "Feb, 2018",
            "end": "May, 2018"
        },
        {
            "company": "Trust Systems & Software",
            "title": "Software Engineer, Intern",
            "location": "Nagpur, Maharashtra, India",
            "responsibilites": "Created and executed comprehensive test plans for software applications, ensuring thorough testing coverage. Identified critical defects and worked closely with development teams to resolve them, improving product quality and customer satisfaction.",
            "start": "May, 2016",
            "end": "June, 2016"
        }
        
    ]
}